In [ ]:
#!pip install pandas
#!pip install faker

In [2]:
import sqlite3
from faker import Faker
from random import randint, choice
import pandas as pd

In [3]:
fake = Faker('pt_BR')

# Conectando e entendendo o banco criado pelo Django

In [4]:
conn = sqlite3.connect('db.sqlite3')

In [5]:
cur = conn.cursor()

## Vendo os nomes das tabelas que o Django criou

In [5]:
query = '''
SELECT name
FROM sqlite_master 
WHERE type ='table' AND name NOT LIKE 'sqlite_%';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c)

('django_migrations',)
('auth_group_permissions',)
('auth_user_groups',)
('auth_user_user_permissions',)
('django_admin_log',)
('django_content_type',)
('auth_permission',)
('auth_group',)
('auth_user',)
('pages_interesses',)
('django_session',)
('pages_aluno',)
('pages_aluno_interesses',)

## Acessando cada tabela

In [6]:
df = pd.read_sql_query('SELECT * FROM pages_interesses', conn)
df.head()

   id categoria  grau    nome
0   1      Arte     1  Música
1   2      Arte     2  Música

In [7]:
df = pd.read_sql_query('SELECT * FROM pages_aluno', conn)
df.head()

,id,nome,idade,sexo,curso,periodo
0,1,Cristiano Larréa,20,M,Ciência de Dados e Inteligência Artificial,2

In [8]:
df = pd.read_sql_query('SELECT * FROM pages_aluno_interesses', conn)
df.head()

   id  aluno_id  interesses_id
0   1         1              1

## Zerando os dados das tabelas

In [7]:
cur.execute('DELETE FROM pages_interesses')
cur.execute('DELETE FROM pages_aluno')
cur.execute('DELETE FROM pages_aluno_interesses')

In [8]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

In [9]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

In [10]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(15):
    print(c)

# Criando dados fakes

## Tabela pages_interesses

In [11]:
categorias = []
categorias.extend(['Arte']*6)
categorias.extend(['Esporte']*10)
categorias.extend(['Entretenimento']*5)
categorias.extend(['Estilos de Música']*12)
categorias.extend(['Social']*9)

In [12]:
nomes = ['Musica', 'Dança', 'Literatura', 'Museu', 'Cinema', 'Teatro',
'Xadrez', 'Volei', 'Futebol', 'Handbol', 'Basquete', 'Tenis de Mesa', 'Natação', 'Crossfit', 'Musculação', 'Golfe',
'Jogos', 'Séries', 'Filmes', 'Novelas', 'Livros',
'Pop', 'Samba', 'Pagode', 'Sertanejo', 'R&B', 'Jazz', 'Blues', 'Piseiro', 'KPOP', 'Funk', 'Rap', 'Trap',
'Festas', 'Boate', 'Churrasco', 'Roda de Samba', 'Passeio no Parque', 'Praia', 'Trilha', 'Piquenique', 'Montanhas']

In [13]:
graus = []
graus.extend([1]*42)
graus.extend([2]*42)
graus.extend([3]*42)
graus.extend([4]*42)
graus.extend([5]*42)

In [14]:
ids = range(1,211)

In [15]:
categorias.extend(categorias*4)
nomes.extend(nomes*4)

In [16]:
interesses = {
    'id': ids,
    'categoria': categorias,
    'grau': graus,
    'nome': nomes
}
df_int = pd.DataFrame(interesses)

In [17]:
df_int

      id categoria  grau               nome
0      1      Arte     1             Musica
1      2      Arte     1              Dança
2      3      Arte     1         Literatura
3      4      Arte     1              Museu
4      5      Arte     1             Cinema
..   ...       ...   ...                ...
205  206    Social     5  Passeio no Parque
206  207    Social     5              Praia
207  208    Social     5             Trilha
208  209    Social     5         Piquenique
209  210    Social     5          Montanhas

[210 rows x 4 columns]

## Tabela pages_alunos

In [18]:
alunos = {
    'id': [],
    'nome':[],
    'idade':[],
    'sexo':[],
    'curso':[],
    'periodo':[]
}


for id in range(1,401):
    alunos['id'].append(id)
    alunos['nome'].append(fake.name())
    alunos['idade'].append(randint(15,50))
    alunos['sexo'].append(choice(['M','F']))
    alunos['curso'].append(choice(['Ciência de Dados e Inteligência Artificial', 'Matemática Aplicada']))
    alunos['periodo'].append(randint(1,8))

In [19]:
df_alunos = pd.DataFrame(alunos)

In [20]:
df_alunos

,id,nome,idade,sexo,curso,periodo
0,1,Dra. Milena Moura,30,F,Ciência de Dados e Inteligência Artificial,3
1,2,Laura Dias,31,F,Ciência de Dados e Inteligência Artificial,4
2,3,Bernardo Silva,30,M,Ciência de Dados e Inteligência Artificial,4
3,4,Lucas Gabriel Silva,17,F,Matemática Aplicada,6
4,5,Maria Cecília Viana,32,F,Matemática Aplicada,3
...,...,...,...,...,...,...
395,396,Vitor Pinto,23,F,Matemática Aplicada,2
396,397,Miguel Carvalho,22,F,Ciência de Dados e Inteligência Artificial,6
397,398,Dr. Danilo Dias,28,M,Matemática Aplicada,5
398,399,Luna Moreira,23,M,Matemática Aplicada,1
399,400,Sr. Marcelo Pinto,21,F,Ciência de Dados e Inteligência Artificial,2

## Tabela pages_interesses_alunos

In [21]:
aluno_interesses = {
    'id': [],
    'aluno_id': [],
    'interesses_id': []
}

In [22]:
for id in range(1, 1501):
    aluno_interesses['id'].append(id),
    aluno_interesses['aluno_id'].append(randint(1,400)),
    aluno_interesses['interesses_id'].append(randint(1,210))

In [23]:
df_alunos_interesses = pd.DataFrame(aluno_interesses)
df_alunos_interesses

        id  aluno_id  interesses_id
0        1       220            166
1        2       344             62
2        3       347             53
3        4       348            189
4        5        33            135
...    ...       ...            ...
1495  1496       146            190
1496  1497       194            139
1497  1498        81            203
1498  1499       249            135
1499  1500       190            165

[1500 rows x 3 columns]

# Registrando dados no banco

In [24]:
data_int = []
for i in range(0,len(df_int)):
    tuple = (int(df_int['id'][i]), str(df_int['categoria'][i]), int(df_int['grau'][i]), (str(df_int['nome'][i])))
    data_int.append(tuple)

In [25]:
cur.executemany('INSERT INTO pages_interesses VALUES (?,?,?,?)', data_int)

In [26]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

(1, 'Arte', 1, 'Musica')
(2, 'Arte', 1, 'Dança')
(3, 'Arte', 1, 'Literatura')
(4, 'Arte', 1, 'Museu')
(5, 'Arte', 1, 'Cinema')
(6, 'Arte', 1, 'Teatro')
(7, 'Esporte', 1, 'Xadrez')
(8, 'Esporte', 1, 'Volei')
(9, 'Esporte', 1, 'Futebol')
(10, 'Esporte', 1, 'Handbol')
(11, 'Esporte', 1, 'Basquete')
(12, 'Esporte', 1, 'Tenis de Mesa')
(13, 'Esporte', 1, 'Natação')
(14, 'Esporte', 1, 'Crossfit')
(15, 'Esporte', 1, 'Musculação')

In [27]:
data_alunos = []
for i in range(0,len(df_alunos)):
    tuple = (int(df_alunos['id'][i]), str(df_alunos['nome'][i]), str(df_alunos['sexo'][i]), int(df_alunos['idade'][i]), str(df_alunos['curso'][i]), int(df_alunos['periodo'][i]))
    data_alunos.append(tuple)

In [28]:
cur.executemany('INSERT INTO pages_aluno VALUES (?,?,?,?,?,?)', data_alunos)

In [29]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

(1, 'Dra. Milena Moura', 'F', '30', 'Ciência de Dados e Inteligência Artificial', 3)
(2, 'Laura Dias', 'F', '31', 'Ciência de Dados e Inteligência Artificial', 4)
(3, 'Bernardo Silva', 'M', '30', 'Ciência de Dados e Inteligência Artificial', 4)
(4, 'Lucas Gabriel Silva', 'F', '17', 'Matemática Aplicada', 6)
(5, 'Maria Cecília Viana', 'F', '32', 'Matemática Aplicada', 3)
(6, 'Dr. Pedro Henrique Cardoso', 'M', '35', 'Ciência de Dados e Inteligência Artificial', 5)
(7, 'Fernanda Lopes', 'M', '24', 'Ciência de Dados e Inteligência Artificial', 5)
(8, 'Maria Eduarda Novaes', 'F', '28', 'Matemática Aplicada', 1)
(9, 'Esther Duarte', 'F', '18', 'Matemática Aplicada', 3)
(10, 'Daniela Oliveira', 'F', '49', 'Ciência de Dados e Inteligência Artificial', 2)
(11, 'Clara Silva', 'F', '40', 'Ciência de Dados e Inteligência Artificial', 7)
(12, 'Vitor Hugo Sales', 'F', '39', 'Matemática Aplicada', 1)
(13, 'Maria Vitória Pinto', 'F', '48', 'Ciência de Dados e Inteligência Artificial', 3)
(14, 'Brenda Oliveira', 'F', '32', 'Ciência de Dados e Inteligência Artificial', 3)
(15, 'Helena Cunha', 'F', '46', 'Ciência de Dados e Inteligência Artificial', 4)

In [30]:
data_int_alunos = []
for i in range(0,len(df_alunos_interesses)):
    tuple = (int(df_alunos_interesses['id'][i]), int(df_alunos_interesses['aluno_id'][i]), int(df_alunos_interesses['interesses_id'][i]))
    data_int_alunos.append(tuple)

In [31]:
cur.executemany('INSERT INTO pages_aluno_interesses VALUES (?,?,?)', data_int_alunos)

IntegrityError: UNIQUE constraint failed: pages_aluno_interesses.aluno_id, pages_aluno_interesses.interesses_id

Está aceitando só 270 registros!

In [32]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(500):
    print(c)

(1, 220, 166)
(2, 344, 62)
(3, 347, 53)
(4, 348, 189)
(5, 33, 135)
(6, 393, 20)
(7, 186, 48)
(8, 186, 85)
(9, 261, 74)
(10, 153, 175)
(11, 84, 74)
(12, 15, 64)
(13, 173, 39)
(14, 383, 209)
(15, 172, 120)
(16, 63, 88)
(17, 265, 24)
(18, 396, 115)
(19, 144, 87)
(20, 77, 70)
(21, 28, 98)
(22, 280, 208)
(23, 26, 130)
(24, 168, 31)
(25, 125, 3)
(26, 269, 150)
(27, 339, 46)
(28, 88, 135)
(29, 51, 108)
(30, 45, 68)
(31, 112, 94)
(32, 135, 173)
(33, 252, 119)
(34, 165, 51)
(35, 62, 63)
(36, 25, 84)
(37, 96, 23)
(38, 266, 123)
(39, 262, 168)
(40, 346, 124)
(41, 314, 41)
(42, 229, 200)
(43, 88, 64)
(44, 286, 98)
(45, 374, 193)
(46, 311, 197)
(47, 396, 112)
(48, 96, 79)
(49, 60, 134)
(50, 163, 139)
(51, 131, 181)
(52, 133, 150)
(53, 330, 21)
(54, 334, 165)
(55, 249, 204)
(56, 90, 28)
(57, 93, 170)
(58, 354, 100)
(59, 168, 70)
(60, 337, 169)
(61, 18, 202)
(62, 94, 118)
(63, 336, 92)
(64, 83, 195)
(65, 85, 179)
(66, 158, 17)
(67, 367, 143)
(68, 156, 57)
(69, 331, 202)
(70, 304, 7)
(71, 29, 113)
(72, 271, 111)
(73, 36, 156)
(74, 400, 139)
(75, 43, 204)
(76, 72, 11)
(77, 229, 199)
(78, 97, 7)
(79, 274, 91)
(80, 34, 136)
(81, 38, 34)
(82, 349, 98)
(83, 25, 90)
(84, 6, 49)
(85, 98, 53)
(86, 89, 190)
(87, 96, 192)
(88, 186, 74)
(89, 149, 167)
(90, 125, 119)
(91, 46, 154)
(92, 115, 83)
(93, 244, 63)
(94, 87, 94)
(95, 14, 15)
(96, 353, 94)
(97, 7, 172)
(98, 88, 58)
(99, 115, 111)
(100, 395, 95)
(101, 356, 61)
(102, 94, 123)
(103, 239, 22)
(104, 168, 120)
(105, 227, 196)
(106, 204, 113)
(107, 53, 187)
(108, 241, 88)
(109, 170, 113)
(110, 196, 163)
(111, 191, 149)
(112, 27, 127)
(113, 346, 83)
(114, 108, 186)
(115, 327, 131)
(116, 22, 28)
(117, 199, 30)
(118, 248, 83)
(119, 358, 173)
(120, 178, 4)
(121, 277, 71)
(122, 234, 1)
(123, 88, 181)
(124, 174, 155)
(125, 386, 49)
(126, 225, 51)
(127, 296, 129)
(128, 203, 98)
(129, 230, 203)
(130, 46, 132)
(131, 224, 144)
(132, 153, 8)
(133, 284, 47)
(134, 209, 42)
(135, 387, 113)
(136, 332, 104)
(137, 46, 135)
(138, 182, 25)
(139, 157, 46)
(140, 209, 51)
(141, 84, 72)
(142, 164, 64)
(143, 251, 199)
(144, 69, 153)
(145, 81, 159)
(146, 159, 160)
(147, 13, 62)
(148, 129, 115)
(149, 240, 185)
(150, 305, 198)
(151, 164, 11)
(152, 102, 124)
(153, 187, 138)
(154, 55, 150)
(155, 335, 57)
(156, 75, 69)
(157, 312, 181)
(158, 202, 197)
(159, 291, 195)
(160, 383, 73)
(161, 147, 204)
(162, 11, 169)
(163, 16, 5)
(164, 260, 93)
(165, 63, 142)
(166, 8, 15)
(167, 370, 190)
(168, 149, 135)
(169, 68, 130)
(170, 360, 197)
(171, 57, 24)
(172, 5, 206)
(173, 128, 88)
(174, 80, 26)
(175, 36, 151)
(176, 379, 82)
(177, 164, 207)
(178, 166, 199)
(179, 89, 91)
(180, 73, 21)
(181, 168, 193)
(182, 140, 127)
(183, 351, 74)
(184, 170, 3)
(185, 324, 185)
(186, 314, 49)
(187, 225, 35)
(188, 353, 192)
(189, 379, 43)
(190, 113, 40)
(191, 319, 77)
(192, 121, 201)
(193, 197, 113)
(194, 23, 66)
(195, 64, 58)
(196, 19, 192)
(197, 45, 108)
(198, 210, 68)
(199, 359, 37)
(200, 42, 122)
(201, 81, 71)
(202, 314, 188)
(203, 31, 203)
(204, 94, 208)
(205, 285, 33)
(206, 264, 91)
(207, 324, 83)
(208, 370, 86)
(209, 245, 39)
(210, 372, 123)
(211, 381, 172)
(212, 339, 168)
(213, 138, 174)
(214, 124, 168)
(215, 64, 71)
(216, 244, 200)
(217, 349, 89)
(218, 280, 173)
(219, 154, 113)
(220, 105, 170)
(221, 129, 199)
(222, 85, 139)
(223, 121, 15)
(224, 247, 91)
(225, 332, 73)
(226, 316, 90)
(227, 93, 173)
(228, 352, 149)
(229, 291, 138)
(230, 8, 192)
(231, 343, 41)
(232, 291, 89)
(233, 238, 182)
(234, 384, 134)
(235, 82, 60)
(236, 148, 181)
(237, 312, 102)
(238, 276, 47)
(239, 291, 86)
(240, 389, 129)
(241, 15, 90)
(242, 316, 29)
(243, 38, 145)
(244, 371, 26)
(245, 84, 96)
(246, 351, 162)
(247, 214, 164)
(248, 351, 7)
(249, 65, 164)
(250, 391, 49)
(251, 140, 173)
(252, 208, 129)
(253, 298, 77)
(254, 233, 172)
(255, 180, 88)
(256, 302, 74)
(257, 184, 75)
(258, 315, 98)
(259, 364, 183)
(260, 149, 203)
(261, 302, 99)
(262, 354, 115)
(263, 301, 145)
(264, 318, 3)
(265, 238, 175)
(266, 86, 55)
(267, 49, 141)

In [ ]:
conn.commit()

## Analisando estrutura da tabela pages_aluno_interesses

In [38]:
query = '''
SELECT sql
FROM sqlite_master
WHERE name = 'pages_aluno_interesses';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c[0])

CREATE TABLE "pages_aluno_interesses" ("id" integer NOT NULL PRIMARY KEY AUTOINCREMENT, "aluno_id" bigint NOT NULL REFERENCES "pages_aluno" ("id") DEFERRABLE INITIALLY DEFERRED, "interesses_id" bigint NOT NULL REFERENCES "pages_interesses" ("id") DEFERRABLE INITIALLY DEFERRED)

In [33]:
conn.commit()
conn.close()